In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\eszeu\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\eszeu\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\eszeu\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\eszeu\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\eszeu\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [4]:
import pandas as pd

In [5]:
pd

In [6]:
hipandas = pd.Series([1,2,3,4,5])
print(hipandas)
print(hipandas.values)
print(hipandas.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

hipandas1 = pd.Series([3,2,4,1,6])
print(hipandas1)
print(hipandas1.values)
print(hipandas1.index)

In [7]:
hipandas1 = pd.Series([3,2,4,1,6])
print(hipandas1)
print(hipandas1.values)
print(hipandas1.index)

0    3
1    2
2    4
3    1
4    6
dtype: int64
[3 2 4 1 6]
RangeIndex(start=0, stop=5, step=1)

In [9]:
dict1 = {'Taipei' : '台北','Taichung' : '台中','Kaosiung' : '高雄'}
city = pd.Series([dict1])
print(city)
print(city.values)
print(city.index)

0    {'Taipei': '台北', 'Taichung': '台中', 'Kaosiung':...
dtype: object
[{'Taipei': '台北', 'Taichung': '台中', 'Kaosiung': '高雄'}]
RangeIndex(start=0, stop=1, step=1)

In [10]:
dict1 = {'Taipei' : '台北','Taichung' : '台中','Kaosiung' : '高雄'}
city = pd.Series(dict1)
print(city)
print(city.values)
print(city.index)

0    {'Taipei': '台北', 'Taichung': '台中', 'Kaosiung':...
dtype: object
[{'Taipei': '台北', 'Taichung': '台中', 'Kaosiung': '高雄'}]
RangeIndex(start=0, stop=1, step=1)

In [12]:
dict1 = {'Taipei' : '台北','Taichung' : '台中','Kaosiung' : '高雄'}

In [13]:
dict1

{'Taipei': '台北', 'Taichung': '台中', 'Kaosiung': '高雄'}

In [ ]:
print(city[Taichung])

In [15]:
dict1 = {'Taipei' : '台北','Taichung' : '台中','Kaosiung' : '高雄'}
city = pd.Series(dict1)
print(city)
print(city.values)
print(city.index)

Taipei      台北
Taichung    台中
Kaosiung    高雄
dtype: object
['台北' '台中' '高雄']
Index(['Taipei', 'Taichung', 'Kaosiung'], dtype='object')

In [16]:
print(city['Taichung'])

台中

In [17]:
print(city['Taichung' : 'Kaosiung'])

Taichung    台中
Kaosiung    高雄
dtype: object

In [18]:
hipandas[0]

1

In [19]:
hipandas[1]

2

In [20]:
hipandas[2]

3

In [21]:
se1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])

SyntaxError: cannot assign to function call (2409767376.py, line 1)

In [22]:
se1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])

In [23]:
se1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
se1[0]

1

In [25]:
se1['a']

1

In [26]:
se1['b']

2

In [27]:
se1['c']

3

In [28]:
df = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]])

TypeError: Field elements must be 2- or 3-tuples, got '16'

In [29]:
df = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]])
df

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

In [30]:
df = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]],index = ['王小明','王二明','王三明','王四明'],
                  columns =['國文','英文','數學','自然','社會'])

In [31]:
df

     國文  英文  數學  自然  社會
王小明   1   2   3   4   5
王二明   6   7   8   9  10
王三明  11  12  13  14  15
王四明  16  17  18  19  20

In [33]:
score = {'國文':{'王小明':65,'王二明':87,'王三明':86,'王四明':97},
         '英文':{'王小明':95,'王二明':57,'王三明':76,'王四明':57},
         '數學':{'王小明':55,'王二明':97,'王三明':66,'王四明':77},
         '自然':{'王小明':45,'王二明':27,'王三明':56,'王四明':67},
         '社會':{'王小明':55,'王二明':57,'王三明':46,'王四明':37}}
df2 = pd.DataFrame(score)

In [34]:
df2

     國文  英文  數學  自然  社會
王小明  65  95  55  45  55
王二明  87  57  97  27  57
王三明  86  76  66  56  46
王四明  97  57  77  67  37

In [36]:
se1 = pd.Series({'王小明':65,'王二明':87,'王三明':86,'王四明':97})

In [37]:
se1 = pd.Series({'王小明':65,'王二明':87,'王三明':55,'王四明':87})
se2 = pd.Series({'王小明':85,'王二明':97,'王三明':82,'王四明':57})
se3 = pd.Series({'王小明':55,'王二明':77,'王三明':66,'王四明':47})
se4 = pd.Series({'王小明':95,'王二明':67,'王三明':96,'王四明':37})
se5 = pd.Series({'王小明':25,'王二明':57,'王三明':86,'王四明':17})
df3 = pd.DataFrame({'國文':se1,'英文':se2,'數學':se3,'自然':se4,'社會':se5})
df3

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [38]:
se1 = pd.Series({'王小明':65,'王二明':87,'王三明':55,'王四明':87})
se2 = pd.Series({'王小明':85,'王二明':97,'王三明':82,'王四明':57})
se3 = pd.Series({'王小明':55,'王二明':77,'王三明':66,'王四明':47})
se4 = pd.Series({'王小明':95,'王二明':67,'王三明':96,'王四明':37})
se5 = pd.Series({'王小明':25,'王二明':57,'王三明':86,'王四明':17})
df3 = pd.DataFrame({'國文':se1,'英文':se2,'數學':se3,'自然':se4,'社會':se5})
df3

     國文  英文  數學  自然  社會
王小明  65  85  55  95  25
王二明  87  97  77  67  57
王三明  55  82  66  96  86
王四明  87  57  47  37  17

In [39]:
se1 = pd.Series({'王小明':65,'王二明':87,'王三明':55,'王四明':87})
se2 = pd.Series({'王小明':85,'王二明':97,'王三明':82,'王四明':57})
se3 = pd.Series({'王小明':55,'王二明':77,'王三明':66,'王四明':47})
se4 = pd.Series({'王小明':95,'王二明':67,'王三明':96,'王四明':37})
se5 = pd.Series({'王小明':25,'王二明':57,'王三明':86,'王四明':17})
df4 = pd.concat([se1,se2,se3,se4,se5], axis =1)
df4.columns =['國文','英文','數學','自然','社會']
df4

      0   1   2   3   4
王小明  65  85  55  95  25
王二明  87  97  77  67  57
王三明  55  82  66  96  86
王四明  87  57  47  37  17

In [41]:
se1 = pd.Series({'王小明':65,'王二明':87,'王三明':55,'王四明':87})
se2 = pd.Series({'王小明':85,'王二明':97,'王三明':82,'王四明':57})
se3 = pd.Series({'王小明':55,'王二明':77,'王三明':66,'王四明':47})
se4 = pd.Series({'王小明':95,'王二明':67,'王三明':96,'王四明':37})
se5 = pd.Series({'王小明':25,'王二明':57,'王三明':86,'王四明':17})
df4 = pd.concat([se1,se2,se3,se4,se5], axis =1)
df4.columns =['國文','英文','數學','自然','社會']
df4

     國文  英文  數學  自然  社會
王小明  65  85  55  95  25
王二明  87  97  77  67  57
王三明  55  82  66  96  86
王四明  87  57  47  37  17

In [42]:
df4['自然']

王小明    95
王二明    67
王三明    96
王四明    37
Name: 自然, dtype: int64

In [43]:
df4['數學']

王小明    55
王二明    77
王三明    66
王四明    47
Name: 數學, dtype: int64

In [44]:
df4['社會']

王小明    25
王二明    57
王三明    86
王四明    17
Name: 社會, dtype: int64

In [47]:
df4[['自然','數學','社會']]

     自然  數學  社會
王小明  95  55  25
王二明  67  77  57
王三明  96  66  86
王四明  37  47  17

In [50]:
df4[df4['國文']>=80]

     國文  英文  數學  自然  社會
王二明  87  97  77  67  57
王四明  87  57  47  37  17

In [54]:
df4[df4['數學']>=30]

     國文  英文  數學  自然  社會
王小明  65  85  55  95  25
王二明  87  97  77  67  57
王三明  55  82  66  96  86
王四明  87  57  47  37  17

In [53]:
df4[df4['社會']>=60]

     國文  英文  數學  自然  社會
王三明  55  82  66  96  86

In [55]:
df4.values

array([[65, 85, 55, 95, 25],
       [87, 97, 77, 67, 57],
       [55, 82, 66, 96, 86],
       [87, 57, 47, 37, 17]], dtype=int64)

In [56]:
df4.values[1]

array([87, 97, 77, 67, 57], dtype=int64)

In [57]:
df4.values[1][2]

77

In [58]:
df4.values[3][4]

17

In [59]:
df4.loc['王小明','社會']

25

In [61]:
df4.loc['王小明',['國文','社會']]

國文    65
社會    25
Name: 王小明, dtype: int64

In [62]:
df4.loc[['王小明','王二明'],['國文','社會']]

     國文  社會
王小明  65  25
王二明  87  57

In [63]:
df4.loc['王小明':]

     國文  英文  數學  自然  社會
王小明  65  85  55  95  25
王二明  87  97  77  67  57
王三明  55  82  66  96  86
王四明  87  57  47  37  17

In [64]:
df4.loc['王小明',:]

國文    65
英文    85
數學    55
自然    95
社會    25
Name: 王小明, dtype: int64

In [67]:
df4.loc[:'王小明','數學' :'社會']

     數學  自然  社會
王小明  55  95  25

In [68]:
df4.loc['王小明':,'數學' :'社會']

     數學  自然  社會
王小明  55  95  25
王二明  77  67  57
王三明  66  96  86
王四明  47  37  17

In [69]:
df4.loc['王二明','自然']

67

In [70]:
df4.loc['王二明',['數學','社會']]

數學    77
社會    57
Name: 王二明, dtype: int64

In [71]:
df4.loc[['王三明','王二明'],['數學','社會']]

     數學  社會
王三明  66  86
王二明  77  57

In [72]:
df4.loc['王三明':]

     國文  英文  數學  自然  社會
王三明  55  82  66  96  86
王四明  87  57  47  37  17

In [73]:
df4.loc['王三明',:]

國文    55
英文    82
數學    66
自然    96
社會    86
Name: 王三明, dtype: int64

In [74]:
df4.loc[:'王二明','數學' :'社會']

     數學  自然  社會
王小明  55  95  25
王二明  77  67  57

In [75]:
df4.loc['王三明':,'自然' :'社會']

     自然  社會
王三明  96  86
王四明  37  17